<a href="https://colab.research.google.com/github/davidanagy/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-09-09 19:01:44--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.228.171
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.228.171|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  47.5MB/s    in 4.0s

2019-09-09 19:01:48 (49.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [2]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [3]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [4]:
import pandas as pd

aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head() # Don't need these.

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [5]:
departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head() # Don't need these.

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [6]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head() # May need these.

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head() # Same columns as order_products__prior.

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [8]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head() # Might need some of these. (Edit: Turns out I won't.)

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [9]:
products = pd.read_csv('products.csv')
print(products.shape)
products.head() # Will definitely need some of these.

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

The goal is to discover how many times certain products were ordered. To do this, I'll basically need to pull each row from "order_products" that contains one of the products in question, and then count up the number of such rows. That means I'll need:

- the product name from "products"
- the product ID associated with the name from "products"
- the order ID column from "order_products"

In [10]:
# First, to concatenate the order_products dataframes.

order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)

(33819106, 4)

In [0]:
assert order_products.shape[0] == (order_products__prior.shape[0] + order_products__train.shape[0]) # Success!

In [12]:
# Now to drop the columns from "products" that I don't need.

products2 = products.drop(['aisle_id', 'department_id'], axis=1)
products2.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [13]:
# I also only want to keep two columns from "order_products."

order_products2 = order_products.drop(['add_to_cart_order', 'reordered'], axis=1)
order_products2.head()

   order_id  product_id
0         2       33120
1         2       28985
2         2        9327
3         2       45918
4         2       30035

In [14]:
# Now to merge!

merged = pd.merge(products2, order_products2, how='inner', on='product_id')
merged.head()

   product_id                product_name  order_id
0           1  Chocolate Sandwich Cookies      1107
1           1  Chocolate Sandwich Cookies      5319
2           1  Chocolate Sandwich Cookies      7540
3           1  Chocolate Sandwich Cookies      9228
4           1  Chocolate Sandwich Cookies      9273

In [15]:
# Finally, I just have to count the number of times each value in "product name" appears, for the top 10 values only.

merged['product_name'].value_counts()[:10]

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Below I've replicated the lesson code; scroll down to "New Code" for my own code.

%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [74]:
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [75]:
tidy = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [76]:
tidy = tidy.rename(columns={'index': 'name', 'variable': 'trt', 'value': 'result'})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [77]:
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [78]:
wide = tidy.pivot_table(index='name', columns='trt', values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

## New code

In [79]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [80]:
# Let's reset the index first.

table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

So basically, here's how the "melt" command works (I think):

1. You select one column to keep, and then have only two other columns: variable and value.

2. The other column names become the values in the 'variable' column.

3. The original values under those columns become the values of the 'value' column.

As such, to get this in "tidy" format, I only want to keep the current 'index' column.

In [81]:
tidy2 = pd.melt(table2, id_vars=['index'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [82]:
# Now I just have to rename and rearrange things so it looks exactly like the original "tidy" table.

tidy2 = tidy2[['variable', 'index', 'value']] # Got help from Stack Overflow.
tidy2

       variable       index  value
0    John Smith  treatmenta    NaN
1    John Smith  treatmentb    2.0
2      Jane Doe  treatmenta   16.0
3      Jane Doe  treatmentb   11.0
4  Mary Johnson  treatmenta    3.0
5  Mary Johnson  treatmentb    1.0

In [83]:
# Next, rename things just like in the lecture.
tidy2 = tidy2.rename(columns={'variable': 'name', 'index': 'trt', 'value': 'result'})
tidy2['trt'] = tidy2['trt'].str.replace('treatment', '')
tidy2

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

In [84]:
# Finally I have to rearrange the rows by treatment.

tidy2 = tidy2.sort_values(by='trt')
tidy2

           name trt  result
0    John Smith   a     NaN
2      Jane Doe   a    16.0
4  Mary Johnson   a     3.0
1    John Smith   b     2.0
3      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [85]:
# I'll reset the index so it looks better.

tidy2 = tidy2.reset_index(drop=True) # Dropping so I don't add a new column.
tidy2 # Perfect!

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

Now to make the pivot table. From what I understand, here's how that works:

1. You select a column(s) (or row(s) I guess) as your index.

2. You select another column(s) as your new column labels.

3. You select another column(s) as your new values.

I need "treatmenta" and "treatmentb" to be my index, "John Smith" etc to be my column names, and the numbers to be my values.

In [86]:
wide2 = tidy2.pivot_table(index='trt', columns='name', values='result')
wide2

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [92]:
# Now I just have to rename and rearrange some things and I'll be done!

wide2 = wide2.rename(index={'a': 'treatmenta', 'b': 'treatmentb'})
wide2 = wide2[['John Smith', 'Jane Doe', 'Mary Johnson']]
wide2

# Just about right; the only thing left to do is to get rid of the "name trt" part. I'll do the other stuff first
# and come back to this when I have time.

name        John Smith  Jane Doe  Mary Johnson
trt
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
flights = sns.load_dataset('flights')

To remind myself of the assignment:

Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [94]:
print(flights.shape)
flights.head()

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [95]:
flights_table = flights.pivot_table(index='year', columns='month', values='passengers')
flights_table # Success!

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [16]:
# First, I need to cut out the products that have less than 2900 orders. I can re-use my earlier code.

df = merged['product_name'].value_counts().reset_index() # I need the product names to be their own column.
df = df.rename(columns={'index': 'product_name', 'product_name': 'frequency'}) # Renaming for my own benefit.
df.head()

             product_name  frequency
0                  Banana     491291
1  Bag of Organic Bananas     394930
2    Organic Strawberries     275577
3    Organic Baby Spinach     251705
4    Organic Hass Avocado     220877

In [17]:
popular_condition = (df['frequency'] > 2900)
popular_products = df.loc[popular_condition, ['product_name', 'frequency']]
popular_products # Success!

                                           product_name  frequency
0                                                Banana     491291
1                                Bag of Organic Bananas     394930
2                                  Organic Strawberries     275577
3                                  Organic Baby Spinach     251705
4                                  Organic Hass Avocado     220877
5                                       Organic Avocado     184224
6                                           Large Lemon     160792
7                                          Strawberries     149445
8                                                 Limes     146660
9                                    Organic Whole Milk     142813
10                                  Organic Raspberries     142603
11                                 Organic Yellow Onion     117716
12                                       Organic Garlic     113936
13                                     Organic Zucchini     109412
14                                  Organic Blueberries     105026
15                                       Cucumber Kirby      99728
16                                   Organic Fuji Apple      92889
17                                        Organic Lemon      91251
18                               Organic Grape Tomatoes      88078
19                             Apple Honeycrisp Organic      87272
20                                  Seedless Red Grapes      86748
21                                     Organic Cucumber      85005
22                                     Honeycrisp Apple      83320
23                                 Organic Baby Carrots      80493
24                           Sparkling Water Grapefruit      79245
25                                  Organic Half & Half      79006
26                 Organic Large Extra Fancy Fuji Apple      78056
27                                        Yellow Onions      76929
28                                 Organic Baby Arugula      75752
29                                  Organic Gala Apples      75655
...                                                 ...        ...
2021                               Thin Spaghetti No 11       2934
2022                        Coconut Water, Pure Organic       2933
2023                          Traditional Italian Sauce       2931
2024           Apple Apple Applesauce On The Go Pouches       2930
2025                              Stir-fry Rice Noodles       2926
2026                 Single Serve Crispy Wheat Crackers       2926
2027                                Mini Peeled Carrots       2925
2028                  Organic Quinoa Dark Chocolate Bar       2925
2029                      Organic Avocados Hass Variety       2925
2030                       Almond Milk Hazelnut Creamer       2923
2031                        Lemon-Lime Fridge Pack Soda       2922
2032  Organic Original Acai Berry + Guarana Smoothie...       2922
2033                         Vanilla Ice Cream Sandwich       2921
2034                                  Organic Capellini       2919
2035                         Plus Lotion Facial Tissues       2919
2036                         Organic Black Mission Figs       2918
2037                      Yellow Corn Organic Tortillas       2916
2038                  Asian Chopped Salad with Dressing       2914
2039                                  Pomegranate Seeds       2914
2040  Oh My Yog! Pacific Coast Strawberry Trilayer Y...       2913
2041                           Vegetarian Refried Beans       2913
2042    Lemon Cayenne Agave Cold Pressed Juice Beverage       2913
2043        Stage 2 Sweet Potato Corn & Apple Baby Food       2912
2044                                             Chives       2912
2045        Organic Free Range Grade A Large Brown Eggs       2908
2046  Creamy Deluxe Macaroni Dinner Elbows & Four Ch...       2905
2047                              Stage 1 - Just Prunes       2902
2048                                   Whole Chia Seeds       2902
2049                            Organic Spelt Tortillas       2902
2050                                   3 lb Clementines       2901

[2051 rows x 2 columns]

In [18]:
# Now to merge this with the products dataframe.

pop_products2 = pd.merge(popular_products, products, how='inner', on='product_name')
pop_products2.head()

             product_name  frequency  product_id  aisle_id  department_id
0                  Banana     491291       24852        24              4
1  Bag of Organic Bananas     394930       13176        24              4
2    Organic Strawberries     275577       21137        24              4
3    Organic Baby Spinach     251705       21903       123              4
4    Organic Hass Avocado     220877       47209        24              4

In [19]:
# Let's make sure it worked the way I wanted it to.

check = pop_products2.sort_values(by=['frequency'], ascending=True)
check.head() # It worked!

                                           product_name  ...  department_id
2050                                   3 lb Clementines  ...              4
2047                              Stage 1 - Just Prunes  ...             18
2049                            Organic Spelt Tortillas  ...              3
2048                                   Whole Chia Seeds  ...             19
2046  Creamy Deluxe Macaroni Dinner Elbows & Four Ch...  ...              9

[5 rows x 5 columns]

In [20]:
# Alright, now that I have access to the product IDs, I need to merge with order_products.
# First though, I'll get rid of the unnecessary columns.

pop_products3 = pop_products2.drop(['aisle_id', 'department_id'], axis=1)
temp = order_products.drop(['add_to_cart_order', 'reordered'], axis=1)

pop_products4 = pd.merge(pop_products3, temp, how='inner', on='product_id')
check2 = pop_products4.sort_values(by=['frequency'], ascending=True)
check2.head()

              product_name  frequency  product_id  order_id
22450885  3 lb Clementines       2901        2447   3373075
22448954  3 lb Clementines       2901        2447   1217889
22448953  3 lb Clementines       2901        2447   1217731
22448952  3 lb Clementines       2901        2447   1216201
22448951  3 lb Clementines       2901        2447   1214882

In [21]:
# And now for the final merge, with the orders dataframe--again, after dropping unnecessary columns.

temp2 = orders.drop(['user_id', 'eval_set', 'order_number', 'order_dow', 'days_since_prior_order'], axis=1)

pop_products_final = pd.merge(pop_products4, temp2, how='inner', on='order_id')
check3 = pop_products_final.sort_values(by=['frequency'], ascending=True)
check3.head()

              product_name  frequency  product_id  order_id  order_hour_of_day
22450885  3 lb Clementines       2901        2447   3058682                 10
8757737   3 lb Clementines       2901        2447   3381117                 16
3494814   3 lb Clementines       2901        2447   2522470                 11
5541437   3 lb Clementines       2901        2447    547542                 13
16940477  3 lb Clementines       2901        2447   2692696                 13

In [0]:
# Alright, at this point I only need two columns.

final = pop_products_final.drop(['frequency', 'product_id', 'order_id'], axis=1)

# Now I need to somehow determine the average order hour of each individual product.

In [27]:
final.groupby('product_name').mean().sort_values('order_hour_of_day', ascending=False)[:25]

# This code was posted by Clay Roberts in the Slack channel. It successfully gives me the right answer,
# but I admit I didn't come up with it myself. I did look up the "groupby" function so I understand
# how it works...that's a really powerful function I'll have to remember.

                                              order_hour_of_day
product_name
Half Baked Frozen Yogurt                              14.526986
The Tonight Dough™ Ice Cream                          14.526299
Americone Dream® Ice Cream                            14.394912
Half Baked® Ice Cream                                 14.388942
Phish Food® Ice Cream                                 14.373308
Milk and Cookies Ice Cream                            14.369711
Sicilian Pistachio                                    14.306421
Chocolate Peanut Butter Cup Gelato                    14.303480
Birthday Cake Light Ice Cream                         14.292018
Cherry Garcia Ice Cream                               14.270300
Strawberry Ice Cream                                  14.268841
Vanilla Bean Light Ice Cream                          14.257849
Coffee Ice Cream                                      14.256280
Roman Raspberry Sorbetto                              14.248191
Mediterranean Mint Gelato                             14.233542
Caramel Cookie Crunch Gelato                          14.224069
Chocolate Chip Cookie Dough Ice Cream                 14.204325
Mint Chip                                             14.189235
Coconut Almond Minis Frozen Dessert Bars              14.156069
Mint Chocolate Chip Ice Cream                         14.134992
Chocolate Peanut Butter Ice Cream                     14.120449
Vanilla Milk Chocolate Almond Ice Cream Bars          14.104662
Sea Salt Caramel Gelato                               14.083895
Vanilla Bean Ice Cream                                14.039406
Rising Crust Pepperoni Pizza                          14.027699

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
# I don't have time to do this right now, but I hope to come back to it later.